Revit 2027 API
DWFExportOptions.ExportTexture Property
Whether to export texture.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportTexture { get; set; }
Public Property ExportTexture As Boolean
	Get
	Set
public:
property bool ExportTexture {
	bool get ();
	void set (bool value);
}
member ExportTexture : bool with get, set
Property Value
Boolean
Remarks
The default value is true. This property only take effect to 3D DWF.
See Also
Reference
DWFExportOptions Class
Autodesk.Revit.DB Namespace